#Вывести на экран числа от -N до N
a = int(input("Введите начальное число диапазона = "))
b = int(input("Введите конечное число диапазона = "))
i = a
while i != b+1:
    print(f'{i}')
    i += 1